// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

Console.Clear();

Console.WriteLine("Введите трехзначное число: ");
    while(true)
    {
        if(true)
        {
        string input = Console.ReadLine();
            Console.WriteLine($"\nВторое число = {input[1]}\n");
        return;
        }
    }
    Console.WriteLine($"End of Program");